#ifndef PATHFINDER_LUT_H
#define PATHFINDER_LUT_H

#define PI 3.14159

// 12个动作阶段，对应12个 Index
uint8_t pf_silverOrePick_IndexNum = 12;	

// 每个动作的持续时间
float pathfinder_silverOrePick_tick2IndexLut[] ={
1000,	// 0	准备好左前矿
500,	// 1	下降吸取左前
500,	// 2	抬升拿走
2000,	// 3	转动臂回转
500,	// 4	下降到左矿仓上一点的位置
500,	// 5	挪到左矿仓正上位置
500,	// 6	把矿放到左矿仓
500,	// 7	挪到左矿仓正上位置
500,	// 8	上升到左矿仓上一点的位置
2000,	// 9	转动臂回转
500,	// 10	抬升拿走，并转动臂回转
2000,	// 11	准备好右前矿
};
// 每个动作对应的关节Q值
float pathfinder_silverOrePick_tick2QMatLut[] ={
0.20, 0.357482, 0.913546, -1.406674,	// 0	准备好左前矿
0.15, 0.357482, 0.913546, -1.406674,	// 1	下降吸取左前
0.20, 0.357482, 0.913546, -1.406674,	// 2	抬升拿走
0.15, 0, PI/2.f, PI/2.f,				// 3	转动臂回转
0.05, 0, PI/2.f, PI/2.f,				// 4	下降到左矿仓上一点的位置
0.05, 0, PI/2.f, PI/2.f,				// 5	挪到左矿仓正上位置
0.02, 0, PI/2.f, PI/2.f,				// 6	把矿放到左矿仓
0.05, 0, PI/2.f, PI/2.f,				// 7	挪到左矿仓正上位置
0.05, 0, PI/2.f, PI/2.f,				// 8	上升到左矿仓上一点的位置
0.15, 0.357482, 0.913546, -1.406674,	// 9	转动臂回转
0.20, 0.357482, 0.913546, -1.406674,	// 10	抬升拿走，并转动臂回转
0.20, -0.357482, -0.913546, 1.406674,	// 11	准备好右前矿
};



#endif